app/controllers/api/v1/todos_controller.rb

INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "123"], ["created_at", "2019-06-12 22:11:43.796938"], ["updated_at", "2019-06-12 22:11:43.796938"]]
---
    def create
      @todo = Todo.new(todo_params)

      if @todo.save

UPDATE "todos" SET "title" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["title", "12334"], ["updated_at", "2019-06-12 22:41:15.632296"], ["id", 3]]
---
    def update
      if @todo.update(todo_params)